<a href="https://colab.research.google.com/github/Dulon18/Interesting_Python_Program/blob/main/Climate_Change.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
from datetime import datetime, timedelta
import matplotlib.pyplot as plt
import seaborn as sns
from statsmodels.tsa.seasonal import seasonal_decompose

In [ ]:
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

In [ ]:
#read dataset 
df=pd.read_csv('/content/GlobalLandTemperaturesByCountry.csv')

In [ ]:
df.dtypes

dt                                object
AverageTemperature               float64
AverageTemperatureUncertainty    float64
Country                           object
Unnamed: 4                       float64
Unnamed: 5                       float64
Country.1                         object
dtype: object

In [ ]:
df.shape

(577462, 7)

In [ ]:
df.head()

           dt  AverageTemperature  ...  Unnamed: 5    Country.1
0  1743-11-01               4.384  ...         NaN        Åland
1  1743-12-01                 NaN  ...         NaN  Afghanistan
2  1744-01-01                 NaN  ...         NaN       Africa
3  1744-02-01                 NaN  ...         NaN      Albania
4  1744-03-01                 NaN  ...         NaN      Algeria

[5 rows x 7 columns]

In [ ]:
df.isnull().sum()

dt                                    0
AverageTemperature                32651
AverageTemperatureUncertainty     31912
Country                               0
Unnamed: 4                       577462
Unnamed: 5                       577462
Country.1                        577219
dtype: int64

In [ ]:
df.drop(columns=['Unnamed: 4','Unnamed: 5'],inplace=True)

In [ ]:
df.head()

           dt  AverageTemperature  ...  Country    Country.1
0  1743-11-01               4.384  ...    Åland        Åland
1  1743-12-01                 NaN  ...    Åland  Afghanistan
2  1744-01-01                 NaN  ...    Åland       Africa
3  1744-02-01                 NaN  ...    Åland      Albania
4  1744-03-01                 NaN  ...    Åland      Algeria

[5 rows x 5 columns]

In [ ]:
df.rename(columns={'dt':'Date','AverageTemperature':'Avg_temp',
                   'AverageTemperatureUncertainty':'Avg_temp_uncertainty'},inplace=True)

In [ ]:
df.head()

         Date  Avg_temp  Avg_temp_uncertainty Country    Country.1
0  1743-11-01     4.384                 2.294   Åland        Åland
1  1743-12-01       NaN                   NaN   Åland  Afghanistan
2  1744-01-01       NaN                   NaN   Åland       Africa
3  1744-02-01       NaN                   NaN   Åland      Albania
4  1744-03-01       NaN                   NaN   Åland      Algeria

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 577462 entries, 0 to 577461
Data columns (total 5 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   Date                  577462 non-null  object
 1   Avg_temp              544811 non-null  float64
 2   Avg_temp_uncertainty  545550 non-null  float64
 3   Country               577462 non-null  object
 4   Country.1             243 non-null     object
dtypes: float64(2), object(3)
memory usage: 22.0+ MB

In [ ]:
df.describe()

            Avg_temp  Avg_temp_uncertainty
count  544811.000000         545550.000000
mean       17.193354              1.019057
std        10.953966              1.201930
min       -37.658000              0.052000
25%        10.025000              0.323000
50%        20.901000              0.571000
75%        25.814000              1.206000
max        38.842000             15.003000

In [ ]:
df['Date'] = pd.to_datetime(df['Date'])
df.set_index('Date',inplace=True)
df.index

DatetimeIndex(['1743-11-01', '1743-12-01', '1744-01-01', '1744-02-01',
               '1744-03-01', '1744-04-01', '1744-05-01', '1744-06-01',
               '1744-07-01', '1744-08-01',
               ...
               '2012-01-12', '2013-01-01', '2013-01-02', '2013-01-03',
               '2013-01-04', '2013-01-05', '2013-01-06', '2013-01-07',
               '2013-01-08', '2013-01-09'],
              dtype='datetime64[ns]', name='Date', length=577462, freq=None)

In [ ]:
latest_df=latest_df[['Country','Avg_temp']].groupby(['Country']).mean().sort_values('Avg_tem')

NameError: ignored